//ДОМАШКА
/*
1. Изучить теорию
2. Решить задачи:
*/

// Задача №1. Верна ли запись?

/*
let fls = "фрилансер";
let text = 'Привет! Я ${fls}';
// Ожидаем получить Привет! Я фрилансер
console.log(text);
 */
// неверно, т.к. для синтаксического сахара нужны обратные каваычки вместо обычных

// Задача №2. Получить символ "н" строки:

/*
let text = 'фрилансер';
console.log(text.slice(-4, -3));
 */

// Задача №3. Верно?

/*
let text = 123 + "456";
// Ожидаем 579
console.log(text);
 */
// Неверно, поскольку при сложении сроки с числом все выражение будет приведено к строковому. Таким образом выведется 123456

// Задача №4. Получить строку в верхнем регистре

/*
let text = 'фрилансер';
console.log(text.toUpperCase());
 */

// Задача №5. Получить подстроку "лан" из:

/*
let text = 'фрилансер';
console.log(text.slice(3, 6));
 */

// Задача №6. true или false ?

/*
let text = 'фрилансер';
console.log(text.includes('лан', 4));
 */
// false, поскольку фрагмент "лан" начинается с 3-й позиции (т.к. отсчет всегда начинается с 0);

//========================================================================================================================================================
//========================================================================================================================================================