

//ДОМАШКА
/*
1. Изучить теорию
2. Решить задачу:
*/
/*
- Создайте форму и отработайте на ней все события и методы из этого урока
- Добавьте к текстовым полям формы валидацию заполнения полей
и счетчик символов
- Запретите вставку текста в объект textarea этой формы
*/




//========================================================================================================================================================
//========================================================================================================================================================
